#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.log_group: Refreshing state... [id=with-s3-1-log-group]
aws_vpc.vpc: Refreshing state... [id=vpc-0a720d5cd61b6ceb5]
aws_launch_template.ecs_launch_template: Refreshing state... [id=lt-008ad959ade65bd1a]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:966137945144:cluster/with-s3-1]
aws_ecs_task_definition.task_definition: Refreshing state... [id=with-s3-1]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0d70a0dabd8bae802]
aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:966137945144:targetgroup/with-s3-1/679215ad58308fe0]
aws_subnet.subnet_2: Refreshing state... [id=subnet-04375ef5275367c2a]
aws_subnet.subnet_1: Refreshing state... [id=subnet-0eee30cb1a6fc92c4]
aws_security_group.alb: Refreshing state... [id=sg-0058e0a03d10d07c3]
aws_route_table.route_table: Refreshing state... [id=rtb-006c23be113e116a8]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0319a615285df8c54]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:966137945144:loadbalancer/app/with-s3-1/987404f00dbe2bec]
aws_autoscaling_group.ecs_asg: Refreshing state... [id=with-s3-1-asg]
aws_route_table_association.route_table_association_1: Refreshing state... [id=rtbassoc-0ded7d6b9220bc047]
aws_route_table_association.route_table_association_2: Refreshing state... [id=rtbassoc-07a632986f45a7869]
aws_ecs_capacity_provider.ecs_cp: Refreshing state... [id=arn:aws:ecs:eu-west-1:966137945144:capacity-provider/with-s3-1-cp]
aws_ecs_cluster_capacity_providers.ecs_cluster_cp: Refreshing state... [id=with-s3-1]
aws_alb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:966137945144:listener/app/with-s3-1/987404f00dbe2bec/329dcdee04776062]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:966137945144:service/with-s3-1/with-s3-1]
aws_appautoscaling_target.ecs: Refreshing state... [id=service/with-s3-1/with-s3-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.ecs_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "ecs_asg" {
        id                        = "with-s3-1-asg"
        name                      = "with-s3-1-asg"
        # (23 unchanged attributes hidden)

      - tag {
          - key                 = "AmazonECSManaged" -> null
          - propagate_at_launch = true -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:eu-west-1:966137945144:service/with-s3-1/with-s3-1"
        name                               = "with-s3-1"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:966137945144:task-definition/with-s3-1:1" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:966137945144:task-definition/with-s3-1:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment            = [] -> null
                  ~ image                  = "public.ecr.aws/u6u0a7r2/node-test:ui-86413e2" -> "public.ecr.aws/u6u0a7r2/node-test:ui-7ab04f0"
                  - mountPoints            = [] -> null
                    name                   = "site"
                  - volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "with-s3-1" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cscleison, Action: `pull_request`, Working Directory: `./apps`, Workflow: `Pull Request Workflow`*